jamesmunns/kinetis-rs/usb/usb_core/hal/fsl_usb_khci_hal.h
	HW_USB_ENDPTn_SET(baseAddr, epNumber,USB_ENDPT_HOSTWOHUB_MASK);
}

/*!
* @brief Set the endpoint in host mode which need handshake or not
* 
* @param baseAddr usb baseAddr id
* @param epNumber endpoint number
* @param isEphshkSet needs handshake or not
*/
static inline void usb_hal_khci_endpoint_enable_handshake(uint32_t baseAddr, uint32_t epNumber, uint32_t isEphshkSet)
{
	
	HW_USB_ENDPTn_SET(baseAddr, epNumber,((isEphshkSet == 1) ? USB_ENDPT_EPHSHK_MASK : 0));
}

/*!
* @brief Set the endpoint in host mode which in TX or RX
* 
* @param baseAddr usb baseAddr id
* @param epNumber endpoint number
* @param isEptxenSet in TX or RX
*/
static inline void usb_hal_khci_endpoint_set_direction(uint32_t baseAddr, uint32_t epNumber, uint8_t isEptxenSet)
{
	
	HW_USB_ENDPTn_SET(baseAddr, epNumber,((isEptxenSet == 1) ? USB_ENDPT_EPTXEN_MASK : USB_ENDPT_EPRXEN_MASK));
}

/*!
* @brief Clear the stall status of the endpoint
* 
* @param baseAddr usb baseAddr id
* @param epNumber endpoint number
*/
static inline void usb_hal_khci_endpoint_clr_stall(uint32_t baseAddr, uint32_t epNumber)
{
	
	HW_USB_ENDPTn_CLR(baseAddr, epNumber, USB_ENDPT_EPSTALL_MASK);
	
}

/*!
* @brief Enable the support for low speed
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_enable_low_speed_support(uint32_t baseAddr)
{
	
	HW_USB_ADDR_SET(baseAddr, USB_ADDR_LSEN_MASK);
}


/*!
* @brief Disable the support for low speed
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_disable_low_speed_support(uint32_t baseAddr)
{
	
	HW_USB_ADDR_CLR(baseAddr, USB_ADDR_LSEN_MASK);
}


/*!
* @brief Enable the pull down
* 
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_enable_pull_down(uint32_t baseAddr)
{
	
	HW_USB_USBCTRL_SET(baseAddr, USB_USBCTRL_PDE_MASK);
}


/*!
* @brief Disable the pull down
* 
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_disable_pull_down(uint32_t baseAddr)
{
	
	HW_USB_USBCTRL_CLR(baseAddr, USB_USBCTRL_PDE_MASK);
}


/*!
* @brief Enable the pull up
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_enable_pull_up(uint32_t baseAddr)
{
	
	HW_USB_OTGCTL_WR(baseAddr, USB_OTGCTL_DPHIGH_MASK |  USB_OTGCTL_OTGEN_MASK |USB_OTGCTL_DMLOW_MASK |USB_OTGCTL_DPLOW_MASK);
}

/*!
* @brief Disable the pull up
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_disable_pull_up(uint32_t baseAddr)
{
	
	HW_USB_OTGCTL_CLR(baseAddr, USB_OTGCTL_DPHIGH_MASK |  USB_OTGCTL_OTGEN_MASK |USB_OTGCTL_DMLOW_MASK |USB_OTGCTL_DPLOW_MASK);
}

/*!
* @brief Enable the DP pull up
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_enable_dp_pull_up(uint32_t baseAddr)
{
	
	HW_USB_OTGCTL_SET(baseAddr, USB_OTGCTL_DPHIGH_MASK);
}

/*!
* @brief Disable the DP pull up
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_disable_dp_pull_up(uint32_t baseAddr)
{
	
	HW_USB_OTGCTL_CLR(baseAddr, USB_OTGCTL_DPHIGH_MASK);
}

//TODO:
static inline uint8_t  usb_hal_khci_set_pull_downs(uint32_t baseAddr, uint8_t bitfield )
{
    HW_USB_OTGCTL_CLR(baseAddr,USB_OTGCTL_DMLOW_MASK | USB_OTGCTL_DPLOW_MASK);
    if(bitfield & 0x01)
    {
        HW_USB_OTGCTL_SET(baseAddr,USB_OTGCTL_DPLOW_MASK);
    }      

    if(bitfield & 0x02)
    {
        HW_USB_OTGCTL_SET(baseAddr,USB_OTGCTL_DMLOW_MASK);     
    }
    return USB_OK;
}
//TODO:
static inline void  usb_hal_khci_clr_usbtrc0(uint32_t baseAddr)
{

    HW_USB_USBTRC0_WR(baseAddr, 0);
}


/*!
* @brief Get OTG status
* @param baseAddr usb baseAddr id
*/
static inline uint8_t usb_hal_khci_get_otg_status(uint32_t baseAddr)
{
    return(HW_USB_OTGSTAT_RD(baseAddr));
}

/*!
* @brief Set the controller to the suspend state
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_set_suspend(uint32_t baseAddr)
{
	
	HW_USB_USBCTRL_SET(baseAddr, USB_USBCTRL_SUSP_MASK);
}


/*!
* @brief Clear the suspend state of the controller
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_clr_suspend(uint32_t baseAddr)
{
	
	HW_USB_USBCTRL_CLR(baseAddr, USB_USBCTRL_SUSP_MASK);
}

/*!
* @brief Set the sof threshold
* @param baseAddr usb baseAddr id
* @param value value used to set
*/
static inline void usb_hal_khci_set_sof_theshold(uint32_t baseAddr, uint32_t value)
{
	
	HW_USB_SOFTHLD_WR(baseAddr, (uint8_t)value);
}

static inline void usb_hal_khci_set_target_token(uint32_t baseAddr, uint8_t token, uint8_t endpoint_number)
{
	
    HW_USB_TOKEN_WR(baseAddr, (uint8_t)(USB_TOKEN_TOKENENDPT(endpoint_number) | token));
}


#else
//#include <stdint.h>
//#include <stdbool.h>
#include <assert.h>


//#include "fsl_usb_features.h"
//#include "device/fsl_device_registers.h"

//! @addtogroup usb_hal
//! @{

//! @file

////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// API
////////////////////////////////////////////////////////////////////////////////
 
#if defined(__cplusplus)
extern "C" {
#endif
#define HW_USB_INSTANCE_COUNT (1U)

/*! 
 * @name Initialization
 * @{
 */

/*!
 * @brief Init the BDT page register from the BDT table
 *
 * @param baseAddr USB baseAddr id
 * @param bdtAddress   the BDT address resides in memory
 * 
 */
static void usb_hal_khci_set_buffer_descriptor_table_addr(uint32_t baseAddr, uint32_t bdtAddress)
{
    
	USB0_BDTPAGE1 = (uint8_t)((uint32_t)bdtAddress >> 8);
	USB0_BDTPAGE2 = (uint8_t)((uint32_t)bdtAddress >> 16);
	USB0_BDTPAGE3 = (uint8_t)((uint32_t)bdtAddress >> 24);
}


/*!
 * @brief Enable the specific Interrupt
 *
 * @param baseAddr  USB baseAddr id
 * @param intrType  specific  interrupt type
 */
static inline void usb_hal_khci_enable_interrupts(uint32_t baseAddr, uint32_t intrType)
{
	
	USB0_INTEN |= (uint8_t)intrType;
}

/*!
 * @brief Enable the specific OTG Interrupt
 *
 * @param baseAddr USB baseAddr id
 * @param specific interrupt type
 * 
 */
static inline void usb_hal_khci_enable_otg_interrupts(uint32_t baseAddr, uint32_t intrType)
{

	//HW_USB_OTGICR_SET((uint8_t)intrType);
	USB0_OTGICR |= (uint8_t)intrType;
}

/*!
 * @brief Disable the specific Interrupt
 *
 * @param baseAddr USB baseAddr id
 * @param intrType  specific interrupt type 
 */
static inline void usb_hal_khci_disable_interrupts(uint32_t baseAddr, uint32_t intrType)
{
	
	USB0_INTEN &= ~(uint8_t)intrType;
}

/*!
 * @brief Get the interrupt status
 *
 * @param baseAddr USB baseAddr id
 * @return specific interrupt type 
 */
static inline uint8_t usb_hal_khci_get_interrupt_status(uint32_t baseAddr)
{
	
	return (USB0_ISTAT);
}

/*!
 * @brief Get the otg interrupt status
 *
 * @param baseAddr USB baseAddr id
 * 
 */
static inline uint8_t usb_hal_khci_get_otg_interrupt_status(uint32_t baseAddr)
{
    //return (HW_USB_OTGISTAT_RD);
	return (USB0_OTGISTAT);
}

/*!
* @brief Clear the specific otg interrupt
*
* @param baseAddr usb baseAddr id
* @param intrType the interrupt type
*/
static inline void usb_hal_khci_clr_otg_interrupt(uint32_t baseAddr, uint32_t intrType)
{
    //HW_USB_OTGISTAT_WR((uint8_t)intrType);
	USB0_OTGISTAT = (uint8_t)intrType;
}

/*!
* @brief Clear all the otg interrupts
*
* @param baseAddr usb baseAddr id
*/
static inline void usb_hal_khci_clr_all_otg_interrupts(uint32_t baseAddr)
{
    //HW_USB_OTGISTAT_WR(0xFF);
	USB0_OTGISTAT = 0xFF;
}

/*!
 * @brief Check if controller is busy on transferring.
 *
 * @param baseAddr USB baseAddr id.
 * @return the value of the TOKENBUSY bit from the control register
 */
static inline uint8_t usb_hal_khci_is_line_stable(uint32_t baseAddr)
{
  //return ((HW_USB_OTGSTAT_RD & USB_OTGSTAT_LINESTATESTABLE_MASK) ? 1:0);
  return ((USB0_OTGSTAT & USB_OTGSTAT_LINESTATESTABLE_MASK) ? 1:0);
}
/*!
 * @brief Get the interrupt enable status
 *
 * @param baseAddr USB baseAddr id
 * @return current enabled interrupt types
 */
static inline uint8_t usb_hal_khci_get_interrupt_enable_status(uint32_t baseAddr)
{
	
	return (USB0_INTEN);
}

/*!
* @brief Clear the specific interrupt
*
* @param baseAddr usb baseAddr id
* @param intrType the interrupt type needs to be cleared
*/
static inline void usb_hal_khci_clr_interrupt(uint32_t baseAddr, uint32_t intrType)
{

	
